# Importing the House Price data from the Melbourne City Database (API)

In [1]:
# Dependencies
import requests
import json
import pandas as pd

In [2]:
# base URL for API
base_url = "https://data.melbourne.vic.gov.au/api/explore/v2.1/catalog/datasets/house-prices-by-small-area-sale-year/records?limit=50&refine=sale_year%3A"

In [3]:
# get all years
min_year = 2000 - 1
max_year = 2016
temp = []

for i in range(max_year, min_year, -1):
    response = requests.get(base_url + str(i)).json()

    year_results = response["results"]

    for j in range(len(year_results)):
        temp.append(year_results[j])
    
    #print(json.dumps(response["results"], indent=4, sort_keys=True))
house_price_df = pd.DataFrame(temp)
house_price_df.head()

,sale_year,small_area,type,median_price,transaction_count
0,2016,East Melbourne,House/Townhouse,1940000.0,35
1,2016,East Melbourne,Residential Apartment,650000.0,129
2,2016,Melbourne (CBD),House/Townhouse,NaN,2
3,2016,Melbourne (CBD),Residential Apartment,435000.0,1264
4,2016,North Melbourne,Residential Apartment,515000.0,231

In [4]:
# Get data from DF
house_price_df.count()

sale_year            347
small_area           347
type                 347
median_price         319
transaction_count    347
dtype: int64

In [6]:
# Drop NA data
house_price_df = house_price_df.dropna(how='any')
house_price_df.count()

sale_year            319
small_area           319
type                 319
median_price         319
transaction_count    319
dtype: int64

In [7]:
# Display clean DF
house_price_df.head()

,sale_year,small_area,type,median_price,transaction_count
0,2016,East Melbourne,House/Townhouse,1940000.0,35
1,2016,East Melbourne,Residential Apartment,650000.0,129
3,2016,Melbourne (CBD),Residential Apartment,435000.0,1264
4,2016,North Melbourne,Residential Apartment,515000.0,231
5,2016,Parkville,House/Townhouse,1761250.0,32